/**2013年7月に集めた選挙データを解析するためのパッケージ。<br>
 * 選挙時のツイートにおける集団性質の解析が主な目的だが、<br>
 * それ以前の収集したデータそのものの統計的な解析も含めるものとする。<br>
 * 
 */
package matz.election.analyzer;

/**本パッケージにおいて、解析のためのエントリポイントとなるクラス。<br>
 * HDFS上のデータをMapReduceプログラムで処理すること、及び、<br>
 * jarに固めてサーバ上で走らせることを念頭に置いて開発されたし。<br>
 * 基本的な思想としては、実際の解析内容ごとにクラスを複数実装しておき、<br>
 * 本クラス内で希望する解析のためのクラスをインスタンス化して実行する。<br>
 * main関数内をその都度書き換えてビルドしなおしてもいいが、<br>
 * オプションと引数によってスイッチできるようにしておくのがベター。<br>
 * @author Matsuzawa
 *
 */
public class AnalyzerMain {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ

	}

}
